///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - сведения о внешней обработке.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	
	Команда = Команды.Добавить();
	Команда.Представление = ЭтотОбъект.Метаданные().Синоним;
	Команда.Идентификатор = ЭтотОбъект.Метаданные().Имя;
	Команда.Использование = "ОткрытиеФормы";
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид",                "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование",       ЭтотОбъект.Метаданные().Синоним);
	ПараметрыРегистрации.Вставить("Версия",             "1.0.1.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим",    ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Команды",            Команды);
	ПараметрыРегистрации.Вставить("Информация",         ЭтотОбъект.Метаданные().Комментарий);
	
	ПараметрыРегистрации.Вставить("Авторы",             НСтр("ru = 'Гордиенко Илья'"));
	ПараметрыРегистрации.Вставить("РепозиторийПроекта", "https://github.com/rarus/letterhead-1c");
	
	Возврат ПараметрыРегистрации;
	
КонецФункции // СведенияОВнешнейОбработке()

#КонецОбласти

#КонецЕсли