///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписатьОперациюБизнесСтатистики("ОткрытиеФормы");
	
	ДобавлятьРазделительСтраниц = Истина;
	Элементы.РезультатОбъединенияДобавлятьРазделительСтраниц.Пометка = ДобавлятьРазделительСтраниц;
	
	БланкМодифицирован     = Ложь;
	ДанныеМодифицированы   = Ложь;
	РезультатМодифицирован = Ложь;
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Бланк.Вывести(Обработка.ПолучитьМакет("ОбразецБланка"));
	ИсточникДанных.Вывести(Обработка.ПолучитьМакет("ОбразецДанных"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЗакрытиеЗапрещено = Модифицированность ИЛИ БланкМодифицирован ИЛИ ДанныеМодифицированы;
	
	Если БланкМодифицирован И НЕ ДанныеМодифицированы Тогда
		ТекстПредупреждения = НСтр("ru='Бланк не сохранен!'");
	ИначеЕсли НЕ БланкМодифицирован И ДанныеМодифицированы Тогда
		ТекстПредупреждения = НСтр("ru='Таблица данных не сохранена!'");
	ИначеЕсли Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru='Изменения не сохранены!'");
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда
		Отказ = Истина;
	ИначеЕсли ЗакрытиеЗапрещено Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			СтрШаблон("%1 %2", ТекстПредупреждения, НСтр("ru='Закрыть форму?'")),
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КоличествоСтрокДанных = ИсточникДанных.ВысотаТаблицы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.БланкСформировать.КнопкаПоУмолчанию          = ТекущаяСтраница = Элементы.СтраницаБланк;
	Элементы.ИсточникДанныхСформировать.КнопкаПоУмолчанию = ТекущаяСтраница = Элементы.СтраницаДанные;
	Элементы.РезультатОбъединенияПечать.КнопкаПоУмолчанию = ТекущаяСтраница = Элементы.СтраницаРезультат;
	
КонецПроцедуры

&НаКлиенте
Процедура БланкПриИзменении(Элемент)
	
	Если НЕ БланкМодифицирован Тогда
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаБланк.Имя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	
	КоличествоСтрокДанных = ИсточникДанных.ВысотаТаблицы;
	Если НЕ ДанныеМодифицированы Тогда
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаДанные.Имя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбъединенияПриИзменении(Элемент)
	
	Если НЕ РезультатМодифицирован Тогда
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаРезультат.Имя, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьБланк(Команда)
	
	ЗагрузитьИзФайла(Элементы.СтраницаБланк);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ЗагрузитьИзФайла(Элементы.СтраницаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьБланк(Команда)
	
	СохранитьВФайл(Элементы.СтраницаБланк);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	СохранитьВФайл(Элементы.СтраницаДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультат(Команда)
	
	СохранитьВФайл(Элементы.СтраницаРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЭтоВызовПоКнопке = Команда <> Неопределено;
	
	Если РезультатМодифицирован Тогда
		
		ТекстПредупреждения = НСтр("ru='Предыдущие изменения будут потеряны. Продолжить?'");
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПродолжитьСформировать", ЭтотОбъект, ЭтоВызовПоКнопке),
			ТекстПредупреждения,
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
			
		Возврат;
		
	КонецЕсли;
	
	ПродолжитьСформировать(КодВозвратаДиалога.Да, ЭтоВызовПоКнопке);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьРазделительСтраниц(Команда)
	
	Если РезультатМодифицирован Тогда
		
		ТекстПредупреждения = НСтр("ru='Результат будет обновлён. Предыдущие изменения будут потеряны. Продолжить?'");
		
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПродолжитьДобавлятьРазделительСтраниц", ЭтотОбъект),
			ТекстПредупреждения,
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
			
		Возврат;
		
	КонецЕсли;
	
	ПродолжитьДобавлятьРазделительСтраниц(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБланк(Команда)
	
	Если БланкМодифицирован Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьОчиститьБланк", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Текущий бланк будет очищен. Все изменения будут потеряны. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОчиститьБланкНаСервере(Бланк);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	ИмяОбъекта = СтрРазделить(ЭтотОбъект.ИмяФормы, ".", ЛОЖЬ);
	ОткрытьФорму(ИмяОбъекта[0]+"."+ИмяОбъекта[1]+".Форма.ОПрограмме",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанные(Команда)
	
	Если ДанныеМодифицированы Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьОчиститьДанные", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Таблица будет очищена. Все изменения будут потеряны. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОчиститьДанныеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура СохранитьВФайл(ЭлементыСтраница)
	
	#Если ВебКлиент Тогда
	Если НЕ Ждать ПодключитьРасширениеРаботыСФайламиАсинх() Тогда
		ПодключитьРасширение(Истина);
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	Если ЭлементыСтраница.Имя = Элементы.СтраницаБланк.Имя Тогда
		ИмяФайла = ИмяФайлаБланка;
	ИначеЕсли ЭлементыСтраница.Имя = Элементы.СтраницаДанные.Имя Тогда
		ИмяФайла = ИмяФайлаДанных;
	ИначеЕсли ЭлементыСтраница.Имя = Элементы.СтраницаРезультат.Имя Тогда
		ИмяФайла = ИмяФайлаРезультата;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
		
		ИмяИРасширение = СтрРазделить(ИмяФайла, ".");
		Если ИмяИРасширение.Количество() > 1 Тогда
			
			Расширение             = ИмяИРасширение[ИмяИРасширение.ВГраница()];
			ИмяИРасширение.Удалить(ИмяИРасширение.ВГраница());
			ИмяПолноеБезРасширения = СтрЗаменить(СтрСоединить(ИмяИРасширение), СтрШаблон(".%1", Расширение), "");
			
			ПапкиКаталогаWindows = СтрРазделить(ИмяПолноеБезРасширения, "\", Ложь);
			ПапкиКаталогаLinux   = СтрРазделить(ИмяПолноеБезРасширения, "/", Ложь);
			
			Если ПапкиКаталогаWindows.Количество() > 1 Тогда
				ИмяФайлаБезПути = ПапкиКаталогаWindows[ПапкиКаталогаWindows.ВГраница()];
			ИначеЕсли ПапкиКаталогаLinux.Количество() > 1 Тогда
				ИмяФайлаБезПути = ПапкиКаталогаLinux[ПапкиКаталогаLinux.ВГраница()];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяФайлаБезПути) Тогда
		ИмяФайлаБезПути = НСтр("ru='Бланк'");
	КонецЕсли;
	
	Если ПустаяСтрока(Расширение) Тогда
		Расширение = "xlsx";
	КонецЕсли;
	
	Если Расширение = "mxl" Тогда
		ИндексФильтра = 0;
	ИначеЕсли Расширение = "pdf" Тогда
		ИндексФильтра = 1;
	ИначеЕсли Расширение = "xls" Тогда
		ИндексФильтра = 2;
	ИначеЕсли Расширение = "xlsx" Тогда
		ИндексФильтра = 3;
	ИначеЕсли Расширение = "txt" Тогда
		ИндексФильтра = 4;
	КонецЕсли;
	
	ДиалогВыбораФайла                             = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.ПолноеИмяФайла              = ИмяФайлаБезПути + "." + Расширение;
	ДиалогВыбораФайла.Фильтр = 
		"Табличный документ (*.mxl)|*.mxl|"
		+ "Документ PDF (*.pdf)|*.pdf|"
		+ "Лист Excel (*.xls)|*.xls|"
		+ "Лист Excel2007-... (*.xlsx)|*.xlsx|"
		+ "Текстовый файл UTF-8 (*.txt)|*.txt";
	
	Если НЕ ИндексФильтра = Неопределено Тогда
		ДиалогВыбораФайла.ИндексФильтра           = ИндексФильтра;
	КонецЕсли;
	
	ДиалогВыбораФайла.МножественныйВыбор          = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Ответ = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если Ответ = Неопределено ИЛИ ПустаяСтрока(Ответ) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяИРасширение = СтрРазделить(ДиалогВыбораФайла.ПолноеИмяФайла, ".");
	Расширение = ИмяИРасширение[ИмяИРасширение.ВГраница()];
	
	Если Расширение = "txt" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.TXT;
	ИначеЕсли Расширение = "xls" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.XLS;
	ИначеЕсли Расширение = "xlsx" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
	ИначеЕсли Расширение = "pdf" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.PDF;
	Иначе
		ТипФайла = ТипФайлаТабличногоДокумента.MXL;
	КонецЕсли;
	
	Если ЭлементыСтраница.Имя = Элементы.СтраницаБланк.Имя Тогда
		
		Если НЕ Ждать Бланк.ЗаписатьАсинх(ДиалогВыбораФайла.ПолноеИмяФайла, ТипФайла) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФайлаБланка = ДиалогВыбораФайла.ПолноеИмяФайла;
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаБланк.Имя, Ложь);
		
	ИначеЕсли ЭлементыСтраница.Имя = Элементы.СтраницаДанные.Имя Тогда
		
		Если НЕ Ждать ИсточникДанных.ЗаписатьАсинх(ДиалогВыбораФайла.ПолноеИмяФайла, ТипФайла) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФайлаДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаДанные.Имя, Ложь);
		
	ИначеЕсли ЭлементыСтраница.Имя = Элементы.СтраницаРезультат.Имя Тогда
		
		Если НЕ Ждать РезультатОбъединения.ЗаписатьАсинх(ДиалогВыбораФайла.ПолноеИмяФайла, ТипФайла) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФайлаРезультата = ДиалогВыбораФайла.ПолноеИмяФайла;
		УстановитьМодифицированностьСтраницы(Элементы.СтраницаРезультат.Имя, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИзФайла(ЭлементыСтраница)
	
	#Если ВебКлиент Тогда
	Если НЕ Ждать ПодключитьРасширениеРаботыСФайламиАсинх() Тогда
		ПодключитьРасширение(Истина);
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ДиалогВыбораФайла               = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = 
		"Табличный документ (*.mxl)|*.mxl|"
		+ "Лист Excel (*.xls)|*.xls|"
		+ "Лист Excel2007-... (*.xlsx)|*.xlsx|"
		+ "Текстовый файл UTF-8 (*.txt)|*.txt";
	
	ДиалогВыбораФайла.Заголовок     = НСтр("ru='Выберите файл'");
	ДиалогВыбораФайла.ИндексФильтра = 0;
	
	Ответ = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если Ответ = Неопределено ИЛИ ПустаяСтрока(Ответ) Тогда
		Возврат;
	КонецЕсли;
	
	Путь           = ДиалогВыбораФайла.ПолноеИмяФайла;
	ИмяИРасширение = СтрРазделить(Путь, ".");
	
	Если ИмяИРасширение.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Расширение = ИмяИРасширение[ИмяИРасширение.ВГраница()];
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Путь", Путь);
	ДопПараметры.Вставить("Расширение", Расширение);
	ДопПараметры.Вставить("ИмяСтраницы", ЭлементыСтраница.Имя);
	
	Оповещение = Новый ОписаниеОповещения("ПрололжитьЗагрузкуИзФайла", ЭтотОбъект, ДопПараметры);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,,Путь, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрололжитьЗагрузкуИзФайла(ОписаниеПомещенногоФайла, ДопПараметры) Экспорт
	
	ПрочитатьИзВХНаСервере(ОписаниеПомещенногоФайла.Адрес, ДопПараметры);
	УстановитьМодифицированностьСтраницы(ДопПараметры.ИмяСтраницы, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированностьСтраницы(ИмяСтраницы, Значение)
	
	Если ИмяСтраницы = Элементы.СтраницаБланк.Имя Тогда
		
		БланкМодифицирован = Значение;
		
		Если Значение Тогда
			Элементы.СтраницаБланк.Заголовок = Элементы.СтраницаБланк.Заголовок + "*";
		Иначе
			Элементы.СтраницаБланк.Заголовок = СтрЗаменить(Элементы.СтраницаБланк.Заголовок, "*", "");
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницы = Элементы.СтраницаДанные.Имя Тогда
		
		ДанныеМодифицированы = Значение;
		
		Если Значение Тогда
			Элементы.СтраницаДанные.Заголовок = Элементы.СтраницаДанные.Заголовок + "*";
		Иначе
			Элементы.СтраницаДанные.Заголовок = СтрЗаменить(Элементы.СтраницаДанные.Заголовок, "*", "");
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницы = Элементы.СтраницаРезультат.Имя Тогда
		
		РезультатМодифицирован = Значение;
		
		Если Значение Тогда
			Элементы.СтраницаРезультат.Заголовок = Элементы.СтраницаРезультат.Заголовок + "*";
		Иначе
			Элементы.СтраницаРезультат.Заголовок = СтрЗаменить(Элементы.СтраницаРезультат.Заголовок, "*", "");
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = БланкМодифицирован ИЛИ ДанныеМодифицированы ИЛИ РезультатМодифицирован;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзВХНаСервере(АдресВХ, ДопПараметры)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(ДопПараметры.Расширение);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Если ДопПараметры.ИмяСтраницы = Элементы.СтраницаБланк.Имя Тогда
		
		Бланк.Прочитать(ИмяВременногоФайла);
		ИмяФайлаБланка = ДопПараметры.Путь;
		
	ИначеЕсли ДопПараметры.ИмяСтраницы = Элементы.СтраницаДанные.Имя Тогда
		
		ИсточникДанных.Прочитать(ИмяВременногоФайла);
		ИмяФайлаДанных = ДопПараметры.Путь;
		КоличествоСтрокДанных = ИсточникДанных.ВысотаТаблицы;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСодержимоеРезультата()
	
	МассивСтрокИсточникаДанных = Новый Массив();
	
	Для НомерСтроки = 1 По ИсточникДанных.ВысотаТаблицы Цикл
		
		СтрокаДокумента = Новый Структура();
		ЕстьСтрока = Ложь;
		
		Для НомерКолонки = 1 По ИсточникДанных.ШиринаТаблицы Цикл
			
			ИмяКолонки = СтрШаблон(НСтр("ru='Столбец%1'"), Формат(НомерКолонки,"ЧГ="));
			ЗначениеКолонки = СокрЛП(ИсточникДанных.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(НомерКолонки,"ЧГ=")).Текст);
			СтрокаДокумента.Вставить(ИмяКолонки, ЗначениеКолонки);
			
			ЕстьСтрока = ЕстьСтрока ИЛИ НЕ ПустаяСтрока(ЗначениеКолонки);
			
		КонецЦикла;
		
		Если ЕстьСтрока Тогда
			МассивСтрокИсточникаДанных.Добавить(СтрокаДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСтрокИсточникаДанных;
	
КонецФункции

&НаСервере
Функция СформироватьРезультат(МассивСтрок)
	
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	
	Для Каждого ЭлементМассива Из МассивСтрок Цикл
		
		Если НЕ ТабДок.ПроверитьВывод(Бланк) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(Бланк);
		
		Для Каждого КлючИЗначение Из ЭлементМассива Цикл
			
			ИмяПараметра = СтрШаблон("#%1", КлючИЗначение.Ключ);
			ЗначениеПараметра = КлючИЗначение.Значение;
			ОбластьПараметра = ТабДок.НайтиТекст(ИмяПараметра,,,, Ложь, Истина);
			
			Пока НЕ ОбластьПараметра = Неопределено Цикл
				
				ТекстЯчейки = ОбластьПараметра.Текст;
				
				Если СтрДлина(ТекстЯчейки) = СтрДлина(ИмяПараметра) Тогда
					
					ОбластьПараметра.Текст = ЗначениеПараметра;
					
				Иначе
					
					// Проверяем символ, следующий за исходным именем параметра.
					// Подставляем значение, если символ - не число (параметр совпал полностью).
					
					ИндексСледующего = СтрНайти(ТекстЯчейки, ИмяПараметра) + СтрДлина(ИмяПараметра);
					СледующийСимвол = Сред(ТекстЯчейки, ИндексСледующего, 1);
					
					Если ПустаяСтрока(СледующийСимвол) ИЛИ СтрНайти("1234567890", СледующийСимвол) = 0 Тогда
						
						ОбластьПараметра.Текст = СтрЗаменить(ТекстЯчейки, ИмяПараметра, ЗначениеПараметра);
						
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьПараметра = ТабДок.НайтиТекст(ИмяПараметра, ОбластьПараметра,,, Ложь, Истина);
				
			КонецЦикла;
			
		КонецЦикла;
		
		УдаляемаяСтрока = "#Столбец";
		ДлинаУдаляемойСтроки = СтрДлина(УдаляемаяСтрока);
		ПустаяОбласть = ТабДок.НайтиТекст(УдаляемаяСтрока,,,, Ложь, Истина);
		
		Пока НЕ ПустаяОбласть = Неопределено Цикл
			
			// Тот же принцип, что и при подстановке.
			// Считаем "именем" параметра всю строку (#Столбец1234) до любого символа, кроме числа.
			
			ТекстЯчейки = ПустаяОбласть.Текст;
			ИндексСледующего = СтрНайти(ТекстЯчейки, УдаляемаяСтрока) + ДлинаУдаляемойСтроки;
			СледующийСимвол = Сред(ТекстЯчейки, ИндексСледующего, 1);
			
			Пока НЕ ПустаяСтрока(СледующийСимвол) И СтрНайти("1234567890", СледующийСимвол) > 0 Цикл
				
				УдаляемаяСтрока = УдаляемаяСтрока + СледующийСимвол;
				ДлинаУдаляемойСтроки = ДлинаУдаляемойСтроки + 1;
				
				ИндексСледующего = СтрНайти(ТекстЯчейки, УдаляемаяСтрока) + ДлинаУдаляемойСтроки;
				СледующийСимвол = Сред(ТекстЯчейки, ИндексСледующего, 1);
				
			КонецЦикла;
			
			ПустаяОбласть.Текст = СтрЗаменить(ПустаяОбласть.Текст, УдаляемаяСтрока, "");
			ПустаяОбласть = ТабДок.НайтиТекст("#Столбец", ПустаяОбласть,,, Ложь, Истина);
			
		КонецЦикла;
		
		Если ДобавлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		БланкМодифицирован                   = Ложь;
		Элементы.СтраницаБланк.Заголовок     = СтрЗаменить(Элементы.СтраницаБланк.Заголовок, "*", "");
		
		ДанныеМодифицированы                 = Ложь;
		Элементы.СтраницаДанные.Заголовок    = СтрЗаменить(Элементы.СтраницаДанные.Заголовок, "*", "");
		
		РезультатМодифицирован               = Ложь;
		Элементы.СтраницаРезультат.Заголовок = СтрЗаменить(Элементы.СтраницаРезультат.Заголовок, "*", "");
		
		Модифицированность                   = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОчиститьБланк(Результат, ДопПараметры=Неопределено) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМодифицированностьСтраницы(Элементы.СтраницаБланк.Имя, Ложь);
	ОчиститьБланкНаСервере(Бланк);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОчиститьДанные(Результат, ДопПараметры=Неопределено) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМодифицированностьСтраницы(Элементы.СтраницаДанные.Имя, Ложь);
	ОчиститьДанныеНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = "")
	
	// Проверим, есть ли подсистема мониторинга
	Если Метаданные.ОбщиеМодули.Найти("ЦентрМониторинга") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:488-выкл Модуля может не быть в системе, обходим синтаксис контроль платформы
	УстановитьБезопасныйРежим(Истина);
	МодульЦентрМониторинга = Вычислить("ЦентрМониторинга");
	// АПК:488-вкл
	
	ИмяОперации = "Инструменты.ПечатьНаБланках." + ИмяОперации;
	МодульЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСформировать(Результат, РегистрироватьОперацию=Ложь) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрироватьОперацию Тогда
		ЗаписатьОперациюБизнесСтатистики("Сформировать");
	КонецЕсли;
	
	Содержимое = ПолучитьСодержимоеРезультата();
	РезультатОбъединения = СформироватьРезультат(Содержимое);
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	Элементы.РезультатОбъединенияПечать.КнопкаПоУмолчанию = Истина;
	
	УстановитьМодифицированностьСтраницы(Элементы.СтраницаРезультат.Имя, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДобавлятьРазделительСтраниц(Результат, ДопПараметры=Неопределено) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДобавлятьРазделительСтраниц                                      = НЕ ДобавлятьРазделительСтраниц;
	Элементы.РезультатОбъединенияДобавлятьРазделительСтраниц.Пометка = ДобавлятьРазделительСтраниц;
	
	УстановитьМодифицированностьСтраницы(Элементы.СтраницаРезультат.Имя, Ложь);
	
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьРасширение(УстановитьЕслиНеПодключено) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПослеПодключения", ЭтотОбъект, УстановитьЕслиНеПодключено));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключения(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если УстановитьЕслиНеПодключено Тогда
		НачатьУстановкуРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ПодключитьРасширение", ЭтотОбъект, Ложь));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Не удалось подключить расширение работы с файлами!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьБланкНаСервере(ТабДок)
	
	ТабДок.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеНаСервере()
	
	ИсточникДанных.Очистить();
	КоличествоСтрокДанных = 0;
	
КонецПроцедуры

#КонецОбласти





